TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0c110x.h
/******************************************************************************
* SYS parameters                                                              *
******************************************************************************/

#define DMA_SYS_N_DMA_CHANNEL                         (1)       /* !< Number of DMA channels implemented in DMA. */
#define DMA_SYS_N_DMA_FULL_CHANNEL                    (0)       /* !< Number of FULL-DMA channels implemented in DMA. */
#define CRC_SYS_CRC32_ENABLE                          (0)       /* !< Parameter to exclude or include 32-bit CRC. */
#define FLASHCTL_SYS_DATAWIDTH                        (64)      /* !< Data bit width of a single flash word. */
#define ADC_SYS_NUM_ANALOG_CHAN                       (16)      /* !< Number of analog channels. */
#define I2C_SYS_FENTRIES                              (4)       /* !< Number of FIFO entries */

/******************************************************************************
* DMA Triggers                                                                *
******************************************************************************/

/* External DMA Triggers */
#define DMA_SOFTWARE_TRIG                             (0)
#define DMA_GENERIC_SUB0_TRIG                         (1)
#define DMA_GENERIC_SUB1_TRIG                         (2)
#define DMA_ADC0_EVT_GEN_BD_TRIG                      (3)

/* Internal DMA Triggers */
#define DMA_CH_0_TRIG                                 (0)


/******************************************************************************
* IOMUX Pin Definitions                                                       *
******************************************************************************/

typedef enum IOMUX_PINCM
{
  IOMUX_PINCM1         = (0),
  IOMUX_PINCM2         = (1),
  IOMUX_PINCM3         = (2),
  IOMUX_PINCM5         = (4),
  IOMUX_PINCM7         = (6),
  IOMUX_PINCM12        = (11),
  IOMUX_PINCM17        = (16),
  IOMUX_PINCM18        = (17),
  IOMUX_PINCM19        = (18),
  IOMUX_PINCM20        = (19),
  IOMUX_PINCM21        = (20),
  IOMUX_PINCM23        = (22),
  IOMUX_PINCM24        = (23),
  IOMUX_PINCM25        = (24),
  IOMUX_PINCM26        = (25),
  IOMUX_PINCM27        = (26),
  IOMUX_PINCM28        = (27),
  IOMUX_PINCM29        = (28),
} IOMUX_PINCM;


/* IOMUX_PINCM1[PF] Bits */
#define IOMUX_PINCM1_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM1_PF_GPIOA_DIO00                   ((uint32_t)0X00000001)
#define IOMUX_PINCM1_PF_SYSCTL_BEEPER                 ((uint32_t)0X00000002)
#define IOMUX_PINCM1_PF_I2C0_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM1_PF_TIMG8_CCP0                    ((uint32_t)0X00000004)
#define IOMUX_PINCM1_PF_SPI0_CS1_POCI1                ((uint32_t)0X00000005)
#define IOMUX_PINCM1_PF_SYSCTL_FCC_IN                 ((uint32_t)0X00000006)
#define IOMUX_PINCM1_PF_TIMA_FAULT1                   ((uint32_t)0X00000007)

/* IOMUX_PINCM2[PF] Bits */
#define IOMUX_PINCM2_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM2_PF_GPIOA_DIO01                   ((uint32_t)0X00000001)
#define IOMUX_PINCM2_PF_I2C0_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM2_PF_TIMG8_CCP1                    ((uint32_t)0X00000004)
#define IOMUX_PINCM2_PF_SYSCTL_HFCLKIN                ((uint32_t)0X00000005)
#define IOMUX_PINCM2_PF_TIMA0_CCP1                    ((uint32_t)0X00000007)

/* IOMUX_PINCM3[PF] Bits */
#define IOMUX_PINCM3_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM3_PF_GPIOA_DIO02                   ((uint32_t)0X00000001)
#define IOMUX_PINCM3_PF_TIMG8_CCP1                    ((uint32_t)0X00000002)
#define IOMUX_PINCM3_PF_SPI0_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM3_PF_TIMA0_CCP0                    ((uint32_t)0X00000004)
#define IOMUX_PINCM3_PF_TIMG8_IDX                     ((uint32_t)0X00000007)

/* IOMUX_PINCM5[PF] Bits */
#define IOMUX_PINCM5_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM5_PF_GPIOA_DIO04                   ((uint32_t)0X00000001)
#define IOMUX_PINCM5_PF_TIMA0_CCP0_CMPL               ((uint32_t)0X00000002)
#define IOMUX_PINCM5_PF_SPI0_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM5_PF_SYSCTL_LFCLKIN                ((uint32_t)0X00000004)
#define IOMUX_PINCM5_PF_SYSCTL_HFCLKIN                ((uint32_t)0X00000005)
#define IOMUX_PINCM5_PF_TIMA0_CCP1_CMPL               ((uint32_t)0X00000007)

/* IOMUX_PINCM7[PF] Bits */
#define IOMUX_PINCM7_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM7_PF_GPIOA_DIO06                   ((uint32_t)0X00000001)
#define IOMUX_PINCM7_PF_TIMG14_CCP1                   ((uint32_t)0X00000002)
#define IOMUX_PINCM7_PF_SPI0_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM7_PF_TIMA0_CCP1                    ((uint32_t)0X00000004)
#define IOMUX_PINCM7_PF_TIMG14_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM7_PF_SPI0_CS0                      ((uint32_t)0X00000006)
#define IOMUX_PINCM7_PF_TIMA_FAULT0                   ((uint32_t)0X00000007)

/* IOMUX_PINCM12[PF] Bits */
#define IOMUX_PINCM12_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM12_PF_GPIOA_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM12_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM12_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM12_PF_TIMA_FAULT0                  ((uint32_t)0X00000005)

/* IOMUX_PINCM17[PF] Bits */
#define IOMUX_PINCM17_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM17_PF_GPIOA_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM17_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_SPI0_POCI                    ((uint32_t)0X00000004)
#define IOMUX_PINCM17_PF_TIMG14_CCP0                  ((uint32_t)0X00000005)
#define IOMUX_PINCM17_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)

/* IOMUX_PINCM18[PF] Bits */
#define IOMUX_PINCM18_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM18_PF_GPIOA_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM18_PF_UART0_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000003)
#define IOMUX_PINCM18_PF_SPI0_SCLK                    ((uint32_t)0X00000004)
#define IOMUX_PINCM18_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM18_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000006)
#define IOMUX_PINCM18_PF_TIMA0_CCP3                   ((uint32_t)0X00000007)

/* IOMUX_PINCM19[PF] Bits */
#define IOMUX_PINCM19_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM19_PF_GPIOA_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM19_PF_UART0_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM19_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000004)
#define IOMUX_PINCM19_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000005)
#define IOMUX_PINCM19_PF_TIMA0_CCP3                   ((uint32_t)0X00000006)
#define IOMUX_PINCM19_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000007)

/* IOMUX_PINCM20[PF] Bits */
#define IOMUX_PINCM20_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM20_PF_GPIOA_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM20_PF_DEBUGSS_SWDIO                ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM20_PF_SPI0_POCI                    ((uint32_t)0X00000004)
#define IOMUX_PINCM20_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM20_PF_TIMG14_CCP0                  ((uint32_t)0X00000006)
#define IOMUX_PINCM20_PF_UART0_CTS                    ((uint32_t)0X00000007)

